In [1]:
!pip install psycopg2-binary sqlalchemy pandas

Collecting psycopg2-binary
  Using cached psycopg2_binary-2.9.11-cp313-cp313-macosx_11_0_arm64.whl.metadata (4.9 kB)
Collecting sqlalchemy
  Using cached sqlalchemy-2.0.44-cp313-cp313-macosx_11_0_arm64.whl.metadata (9.5 kB)
Collecting pandas
  Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl.metadata (91 kB)
Collecting typing-extensions>=4.6.0 (from sqlalchemy)
  Using cached typing_extensions-4.15.0-py3-none-any.whl.metadata (3.3 kB)
Collecting numpy>=1.26.0 (from pandas)
  Using cached numpy-2.3.5-cp313-cp313-macosx_14_0_arm64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached psycopg2_binary-2.9.11-cp313-cp313-macosx_11_0_arm64.whl (3.9 MB)
Using cached sqlalchemy-2.0.44-cp313-cp313-macosx_11_0_arm64.whl (2.1 MB)
Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl (10.7 MB)
Using cached numpy-2.3.5-cp313-cp313-macosx_14_0_arm64.whl (5.1 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached typing_extensions-4.15.0-py3-none-any.whl (44 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, typing-extensions, psycopg2-binary, numpy, sqlalchemy, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7/7 [pandas]2m6/7 [pandas]emy]nsions]
Successfully installed numpy-2.3.5 pandas-2.3.3 psycopg2-binary-2.9.11 pytz-2025.2 sqlalchemy-2.0.44 typing-extensions-4.15.0 tzdata-2025.2

In [2]:
# Import necessary libraries
import psycopg2
from sqlalchemy import create_engine
import pandas as pd

In [3]:
# load the data into a pandas DataFrame
df = pd.read_csv('raw_data/flour4four_orders_oct2025.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 17 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          10000 non-null  object
 1   order_date        9372 non-null   object
 2   delivery_date     10000 non-null  object
 3   business_id       10000 non-null  object
 4   business_name     9398 non-null   object
 5   business_type     9013 non-null   object
 6   business_address  9022 non-null   object
 7   contact_name      10000 non-null  object
 8   contact_phone     10000 non-null  int64
 9   flour_type        9358 non-null   object
 10  quantity_bags     10000 non-null  int64
 11  price_per_bag     9364 non-null   float64
 12  total_amount      10000 non-null  int64
 13  payment_method    10000 non-null  object
 14  order_status      10000 non-null  object
 15  rider_name        10000 non-null  object
 16  rider_phone       10000 non-null  int64
dtypes: float64(1), int64(4), object(12)
memory usage: 1.3+ MB

In [4]:
# Handle missing (null) values
df["order_date"] = df["order_date"].fillna(df["delivery_date"])
df["business_name"] = df["business_name"].fillna("Unknown")
df["business_type"] = df["business_type"].fillna("Unknown")
df["business_address"] = df["business_address"].fillna("Unknown")
df["flour_type"] = df["flour_type"].fillna("Unknown")

df["price_per_bag"] = df["price_per_bag"].fillna(df["price_per_bag"].median())

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 17 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          10000 non-null  object
 1   order_date        10000 non-null  object
 2   delivery_date     10000 non-null  object
 3   business_id       10000 non-null  object
 4   business_name     10000 non-null  object
 5   business_type     10000 non-null  object
 6   business_address  10000 non-null  object
 7   contact_name      10000 non-null  object
 8   contact_phone     10000 non-null  int64
 9   flour_type        10000 non-null  object
 10  quantity_bags     10000 non-null  int64
 11  price_per_bag     10000 non-null  float64
 12  total_amount      10000 non-null  int64
 13  payment_method    10000 non-null  object
 14  order_status      10000 non-null  object
 15  rider_name        10000 non-null  object
 16  rider_phone       10000 non-null  int64
dtypes: float64(1), int64(4), object(12)
memory usage: 1.3+ MB

In [7]:
df.head()

,order_id,order_date,delivery_date,business_id,business_name,business_type,business_address,contact_name,contact_phone,flour_type,quantity_bags,price_per_bag,total_amount,payment_method,order_status,rider_name,rider_phone
0,ORD-214576,2025-10-25,2025-10-25,BIZ-1018,"Adams, Zuniga and Wong",Restaurant,"Herbert Macaulay Way, Abuja",Elimu Agbaje,8017507864,Unknown,26,9500.0,247000.0,POS,Delivered,Aisha Bello,8089864260
1,ORD-299448,2025-10-08,2025-10-08,BIZ-1006,Blake and Sons,Bakery,"Ahmadu Bello Way, Abuja",Bolanle Kalumba,8055667651,Bread Flour,27,10000.0,270000.0,POS,Cancelled,Tunde Oladipo,8019121552
2,ORD-246991,2025-10-17,2025-10-17,BIZ-1052,Chapman and Sons,Cafe,"Ahmadu Bello Way, Abuja",Hassan Nyoni,8083863413,Pastry Flour,21,9800.0,205800.0,Bank Transfer,Cancelled,Tunde Oladipo,8019121552
3,ORD-392075,2025-10-13,2025-10-13,BIZ-1035,Rodriguez-Graham,Restaurant,"Herbert Macaulay Way, Abuja",Mandela Onyango,8075228535,All-purpose,20,10500.0,210000.0,Bank Transfer,Pending,Tunde Oladipo,8019121552
4,ORD-179046,2025-10-14,2025-10-14,BIZ-1039,"Romero, Gonzalez and Brooks",Unknown,"Garki Area 1, Abuja",Mojisola Seko,8060119651,Bread Flour,40,10000.0,380000.0,POS,Pending,Emeka John,8019196777

In [5]:
# Convert data types
df["order_date"] = pd.to_datetime(df["order_date"])
df["delivery_date"] = pd.to_datetime(df["delivery_date"])

df["contact_phone"] = df["contact_phone"].astype(str)
df["rider_phone"] = df["rider_phone"].astype(str)

df["total_amount"] = df["total_amount"].astype(float)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 17 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          10000 non-null  object
 1   order_date        10000 non-null  datetime64[ns]
 2   delivery_date     10000 non-null  datetime64[ns]
 3   business_id       10000 non-null  object
 4   business_name     10000 non-null  object
 5   business_type     10000 non-null  object
 6   business_address  10000 non-null  object
 7   contact_name      10000 non-null  object
 8   contact_phone     10000 non-null  object
 9   flour_type        10000 non-null  object
 10  quantity_bags     10000 non-null  int64
 11  price_per_bag     10000 non-null  float64
 12  total_amount      10000 non-null  float64
 13  payment_method    10000 non-null  object
 14  order_status      10000 non-null  object
 15  rider_name        10000 non-null  object
 16  rider_phone       10000 non-null  object
dtypes: datetime64[ns](2), float64(2), int64(1), object(12)
memory usage: 1.3+ MB

## Data Transformation

In [6]:
# create dimension table for business
dim_business = df[[
    "business_id",
    "business_name",
    "business_type",
    "business_address",
    "contact_name",
    "contact_phone"
]].drop_duplicates(subset="business_id").reset_index(drop=True)
dim_business.head()

,business_id,business_name,business_type,business_address,contact_name,contact_phone
0,BIZ-1018,"Adams, Zuniga and Wong",Restaurant,"Herbert Macaulay Way, Abuja",Elimu Agbaje,8017507864
1,BIZ-1006,Blake and Sons,Bakery,"Ahmadu Bello Way, Abuja",Bolanle Kalumba,8055667651
2,BIZ-1052,Chapman and Sons,Cafe,"Ahmadu Bello Way, Abuja",Hassan Nyoni,8083863413
3,BIZ-1035,Rodriguez-Graham,Restaurant,"Herbert Macaulay Way, Abuja",Mandela Onyango,8075228535
4,BIZ-1039,"Romero, Gonzalez and Brooks",Unknown,"Garki Area 1, Abuja",Mojisola Seko,8060119651

In [9]:
# create dimension table for rider
dim_rider = df[[
    "rider_name",
    "rider_phone"
]].drop_duplicates().reset_index(drop=True)

# Add surrogate key
dim_rider["rider_id"] = range(1, len(dim_rider) + 1)
dim_rider = dim_rider[["rider_id","rider_name","rider_phone"]]
dim_rider.head()

   rider_id     rider_name rider_phone
0         1    Aisha Bello  8089864260
1         2  Tunde Oladipo  8019121552
2         3     Emeka John  8019196777
3         4   Grace Onyema  8041568532

In [12]:
# create dimension table for flour type
dim_flour = df[["flour_type"]].drop_duplicates().reset_index(drop=True)

dim_flour["flour_type_id"] = range(100, len(dim_flour) + 100)

dim_flour = dim_flour[["flour_type_id","flour_type"]]

dim_flour.head()

   flour_type_id    flour_type
0            100       Unknown
1            101   Bread Flour
2            102  Pastry Flour
3            103   All-purpose
4            104   Whole Wheat

In [13]:
fact_orders = df.copy()

# Merge to add flour_type_id
fact_orders = fact_orders.merge(dim_flour, on="flour_type", how="left") \
    .merge(dim_rider, on=["rider_name", "rider_phone"], how="left") \
        [["order_id","order_date","delivery_date","business_id","rider_id","flour_type_id","quantity_bags","price_per_bag","total_amount","payment_method","order_status"]]

fact_orders.head()

,order_id,order_date,delivery_date,business_id,rider_id,flour_type_id,quantity_bags,price_per_bag,total_amount,payment_method,order_status
0,ORD-214576,2025-10-25,2025-10-25,BIZ-1018,1,100,26,9500.0,247000.0,POS,Delivered
1,ORD-299448,2025-10-08,2025-10-08,BIZ-1006,2,101,27,10000.0,270000.0,POS,Cancelled
2,ORD-246991,2025-10-17,2025-10-17,BIZ-1052,2,102,21,9800.0,205800.0,Bank Transfer,Cancelled
3,ORD-392075,2025-10-13,2025-10-13,BIZ-1035,2,103,20,10500.0,210000.0,Bank Transfer,Pending
4,ORD-179046,2025-10-14,2025-10-14,BIZ-1039,3,101,40,10000.0,380000.0,POS,Pending

## DATA LOADING

In [14]:
# define database connection parameters
db_name = 'f4f_db'
db_user = 'postgres'
db_password = 'password'
db_host = 'localhost'
db_port = '5432'

In [16]:
# setting up db connection
def get_connection():
    connection = psycopg2.connect(
        dbname=db_name,
        user=db_user,
        password=db_password,
        host=db_host,
        port=db_port
    )

    return connection

conn = get_connection()

In [17]:
def create_tables():
    conn = get_connection()
    cursor = conn.cursor()
    create_tables_query = """
                CREATE SCHEMA IF NOT EXISTS flour4four;

                DROP TABLE IF EXISTS flour4four.fact_orders CASCADE;
                DROP TABLE IF EXISTS flour4four.dim_business CASCADE;
                DROP TABLE IF EXISTS flour4four.dim_flour CASCADE;
                DROP TABLE IF EXISTS flour4four.dim_rider CASCADE;

                CREATE TABLE flour4four.dim_business (
                    business_id       VARCHAR PRIMARY KEY,
                    business_name     VARCHAR NOT NULL,
                    business_type     VARCHAR,
                    business_address  VARCHAR,
                    contact_name      VARCHAR NOT NULL,
                    contact_phone     VARCHAR NOT NULL
                );

                CREATE TABLE flour4four.dim_flour (
                    flour_type_id SERIAL PRIMARY KEY,
                    flour_type VARCHAR
                );

                CREATE TABLE flour4four.dim_rider (
                    rider_id SERIAL PRIMARY KEY,
                    rider_name VARCHAR NOT NULL,
                    rider_phone VARCHAR NOT NULL
                );

                CREATE TABLE flour4four.fact_orders (
                    order_id       VARCHAR PRIMARY KEY,
                    order_date     DATE NOT NULL,
                    delivery_date  DATE NOT NULL,
                    business_id    VARCHAR NOT NULL REFERENCES flour4four.dim_business(business_id),
                    rider_id    INT NOT NULL REFERENCES flour4four.dim_rider(rider_id),
                    flour_type_id     INT NOT NULL REFERENCES flour4four.dim_flour(flour_type_id),
                    quantity_bags  INT NOT NULL,
                    price_per_bag   NUMERIC NOT NULL,
                    total_amount   NUMERIC NOT NULL,
                    payment_method VARCHAR NOT NULL,
                    order_status   VARCHAR NOT NULL
                );
    """
    cursor.execute(create_tables_query)
    conn.commit()
    cursor.close()
    conn.close()
    print("Tables created successfully.")

create_tables()

Tables created successfully.

In [18]:
engine = create_engine(f'postgresql://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}')
print(engine)

Engine(postgresql://postgres:***@localhost:5432/f4f_db)

In [19]:
dim_business.to_sql(
    "dim_business", engine,
    schema="flour4four",
    if_exists="append", index=False
)

dim_flour.to_sql(
    "dim_flour", engine,
    schema="flour4four",
    if_exists="append", index=False
)

dim_rider.to_sql(
    "dim_rider", engine,
    schema="flour4four",
    if_exists="append", index=False
)

fact_orders.to_sql(
    "fact_orders", engine,
    schema="flour4four",
    if_exists="append", index=False
)

print("✔ Data successfully loaded into PostgreSQL!")

✔ Data successfully loaded into PostgreSQL!